naboo90/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-152.12  -35.92  -18.35)   // 0
    (  67.87  -35.92  -18.35)   // 1
    (  67.87   37.78  -18.35)   // 2
    (-152.12   37.78  -18.35)   // 3
    (-152.12  -35.92   22.02)   // 4
    (  67.87  -35.92   22.02)   // 5
    (  67.87   37.78   22.02)   // 6
    (-152.12   37.78   22.02)   // 7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (60 30 20) simpleGrading (1 1 1)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
